src/cf/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ОприходованиеТоваров/ManagerModule.bsl
#Область Печать

Процедура ПечатьНакладнаяНаОприходованиеТоваров(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ОприходованиеТоваров_НакладнаяНаОприходованиеТоваров";
	Макет = Документы.ОприходованиеТоваров.ПолучитьМакет("НакладнаяНаОприходованиеТоваров");	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, НСтр("fr = 'Entrée des marchandises'; ru = 'Оприходование товаров'; en = 'Registration of goods'; es = 'Compra de bienes'"));
	Таб.Вывести(оЗаголовок);
	оПолучатель = Макет.ПолучитьОбласть("Получатель");	
	оПолучатель.Параметры.ПредставлениеПолучателя = Док.Организация;
	Таб.Вывести(оПолучатель);
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.НомерСтроки КАК НомерСтроки,
	                      |	ТЧТовары.Номенклатура.Артикул КАК Артикул,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Единица
	                      |		ИНАЧЕ ТЧТовары.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧТовары.Количество КАК Количество,
	                      |	ТЧТовары.Номенклатура.Единица КАК ЕдиницаХранения,
	                      |	ТЧТовары.Цена КАК Цена,
	                      |	ТЧТовары.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров.ТЧТовары КАК ТЧТовары
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Док");
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
	оСтрока = Макет.ПолучитьОбласть("Строка"); 	
	Для Каждого Стр Из ТЗ Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оИтого = Макет.ПолучитьОбласть("Итого");
	СуммаОприходования = ТЗ.Итог("Сумма");
	оИтого.Параметры.Всего = СуммаОприходования;
	Таб.Вывести(оИтого);
	оСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	//оСуммаПрописью.Параметры.ИтоговаяСтрока = "Всего наименований " + СокрЛП(ТЗ.Количество()) + ", на сумму " + Формат(СуммаОприходования, "ЧЦ=12; ЧДЦ=2") + " руб.";
	оСуммаПрописью.Параметры.СуммаПрописью = Справочники.Валюты.СформироватьСуммуПрописью(СуммаОприходования, Справочники.Валюты.MoroccanDirham, Перечисления.Локализации.fr_CA);
	Таб.Вывести(оСуммаПрописью);
	Таб.Вывести(Макет.ПолучитьОбласть("Подписи"));
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

#КонецОбласти
